app/src/main/res/raw/soap_abolish_task.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <AbolishTask xmlns="http://railway.gtwise.com">
            <sAbolish_reason>$sAbolish_reason</sAbolish_reason>
            <sTaskId>$sTaskId</sTaskId>
            <sOrgId>$sOrgId</sOrgId>
            <sUserName>$sUserName</sUserName>
            <sAuthInfo>$sAuthInfo</sAuthInfo>
            <sSessionKey>$sSessionKey</sSessionKey>
        </AbolishTask>
    </soap:Body>
</soap:Envelope>
